{
    "ds_id": "fbc23368-e5f3-4b23-81ef-31e5cc7f208f", 
    "name": "UN Global Industrial Production Index",
    "ds_source": "https://data.un.org/",
    "raw data file": "SYB58_35_Index of industrial production.csv",
    "cleaned data file": "SYB58_35_Index of industrial production_clean.csv",
    "last updated": "2020-11-05",
    "meta-attributes": {
        "context": {
            "domain": "economics, geography",
            "process": "time series, industrial operations, manufacturing, economic production",
            "situation": "global data, United Nations data, relative to 2005. economic activity defined by UNSD ISICrev3 (https://unstats.un.org/unsd/classifications/Econ/isic)"
        },
        "variables": {
            "Region/Country/Area": "dimension. spatial, location. nations in the world, represents 127 UN-recognized countries and states. country",
            "Year": "dimension. time, year. collected every year, usually from 2008 t0 2014 with only few gaps. year",
            "Index of industrial production: Basic metals (Index base: 2005=100)": "fact. ratio, relative to 2005. measures production of basic metals, which UNSD ISIC defines as iron, steel, silver, gold, platinum, copper, nickel, aluminium, alumina, lead, zinc, tin, manganese, chrome, and other misc metals, Div 27 in UNSD ISICrev3. basicmetals_prod_index",
            "Index of industrial production: Chemicals, petroleum, rubber and plastic products (Index base: 2005=100)": "fact. ratio, relative to 2005. measures production of petro-chemical and organic materials products including fertilizer, plastic, pesticides, soap, pharmaceuticals, paint, perfume, synthetic fibres, tyres, gasoline, etc., Divs 23, 24, 25 in UNSD ISICrev3. petrochem_prod_index",
            "Index of industrial production: Electricity, gas and water (Index base: 2005=100)": "fact. ratio, relative to 2005. measures electricity, natural gas, and heated (or chilled) water production in the context of supplying as utilities through pre-built infrastructure for purposes like cooking, showering, lighting etc., AND measures production of drinking water purified for the purpose of human consumption in the context of supplying as utilities through pre-built infrastructure, Divs 40 and 41 of UNSD ISICrev3. elecgassteam_dwater_prod_index",
            "Index of industrial production: Electricity, gas, steam (Index base: 2005=100)": "fact. ratio, relative to 2005. measures electricity, combustable gas, and heated (or chilled) water production in the context of supplying as utilities through pre-built infrastructure for purposes like cooking, showering, lighting etc., Div 40 of UNSD ISICrev3. elecgassteam_prod_index",
            "Index of industrial production: Food, beverages and tobacco (Index base: 2005=100)": "fact. ratio, relative to 2005. measures production and processing of food, drinks, tobacco like meats, fruits, vegetables, seafood, dairy, carbohydrate staples, prepared foods, spirits, alcohol, soft drinks, bottled waters, etc., Divs 15, 16 of UNSD ISICrev3. food_bev_tobacco_prod_index",
            "Index of industrial production: Machinery (Index base: 2005=100)": "fact. ratio, relative to 2005. measures production of general purpose and special purpose mechanical machinery (mechanical or electrical), including pumps, compressors, engines, valves, furnaces, weapons, machinery for purposes of agriculture, mining, food, logistics etc, office and computing machinery, electric machinery including generator, transformers, process control units, lighting equipment etc., Divs 29, 30, 31 of UNSD ISICrev3. machine_prod_index",
            "Index of industrial production: Manufacturing (Index base: 2005=100)": "fact. ratio, relative to 2005. measures aggregated manufacturing production, general manufacturing activity, includings many (but not all) of the other variables in this dataset, Divs 15 - 37 of UNSD ISICrev3. aggmanufac_prod_index",
            "Index of industrial production: Metal products (Index base: 2005=100)": "fact. ratio, relative to 2005. measures production of fabricated, or otherwise manufactured, metal products and the industrial activities and services involved in the production of metal products including rolling, stamping, coating, treating, pressing, general mechanical engineering etc. of products including tanks, containers, hand tools, cutlery, general hardware, etc., Div 28 of UNSD ISICrev3. metalproducts_prod_index",
            "Index of industrial production: Metal products and machinery (Index Base: 2005=100)": "fact. ratio, relative to 2005. measures production of fabricated, or otherwise manufactured, metal products and the industrial activities and services involved in the production of metal products including rolling, stamping, coating, treating, pressing, general mechanical engineering etc. of products including tanks, containers, hand tools, cutlery, general hardware, etc.; and measures production of general purpose and special purpose mechanical machinery (mechanical or electrical), including pumps, compressors, engines, valves, furnaces, weapons, machinery for purposes of agriculture, mining, food, logistics etc, office and computing machinery, electric machinery including generator, transformers, process control units, lighting equipment etc., Divs 28, 29, 30, 31 of UNSD ISICrev3. metalproducts_machine_prod_index",
            "Index of industrial production: Mining (Index base: 2005=100)": "fact. ratio, relative to 2005. measures mining, quarrying, and similar resource extraction activity including extraction of coal, peat, natural gas, oil, metal ores, salt, stone etc., Divs 10, 11, 12, 13, 14 of UNSD ISICrev3. mining_prod_index",
            "Index of industrial production: Mining and manufacturing (Index base: 2005=100)": "fact. ratio, relative to 2005. measures mining, quarrying, and similar resource extraction activity including extraction of coal, peat, natural gas, oil, metal ores, salt, stone etc.; and measures aggregated manufacturing production, general manufacturing activity, includings many (but not all) of the other variables in this dataset, Divs 10 - 37 of UNSD ISICrev3. mining_aggmanufac_prod_index",
            "Index of industrial production: Miscellaneous manufacturing industries (Index base: 2005=100)": "fact. ratio, relative to 2005. measures production of products and items not contianed in other categories including jewellery, toys, musical instruments, sports equipment and other miscellaceous items, Div 36 of UNSD ISICrev3. miscmanufac_prod_index",
            "Index of industrial production: Textiles, wearing apparel, leather, footwear (Index base: 2005=100)": "fact. ratio, relative to 2005. measures production of raw materials and finished products in the context of clothing and other fibre-based articles, including fabrics, clothes, carpets, knits, leather, luggage, bags, rope etc., Divs 17 18 19 of UNSD ISICrev3. clothingfabric_prod_index",
            "Index of industrial production: Total industry - Mining; manufacturing; electricity, gas and water (Index base: 2005=100)": "fact. ratio, relative to 2005. measures aggregated production of mining; all manufacturing; and (all as utilities) electricity, natural gas, steam, heated water, and drinking water. Divs 10 - 37, 40, 41 of UNSD ISICrev3. mining_aggmanufac_elecgassteam_dwater_prod_index",
            "Index of industrial production: Water and waste management (Index base: 2005=100)": "fact. ratio, relative to 2005. measures production of water as a utility to be distributed through pre-built infrastructure, and waste recycling of metal and non-metal materials, Divs 37, 41 of UNSD ISICrev3. water_waste_prod_index"
        },
        "size": {
            "rows": 922,
            "description": "922 records. yearly records during 2008-2014 for majority of countries, 2008-2012 for almost all, with very rare gaps in timeline. time resolution is 1 year. location spans 127 UN nations and countries including disputed ones. location resolution is the nations and countries mentioned in the location variable"
        }
    }
}