{
    "ds_id": "8bc46972-5bde-42b0-b84b-11558e8fca07",
    "name": "UN Global Population/Census",
    "ds_source": "https://data.un.org/",
    "raw data file": "SYB63_1_202009_Population, Surface Area and Density.csv",
    "cleaned data file": "SYB63_1_202009_Population, Surface Area and Density_clean.csv",
    "last updated": "2020-11-05",
    "meta-attributes": {
        "context": {
            "domain": "economics, social sciences, anthropology, sociology, geography",
            "process": "demographics, time series, land coverage, gender distribution, age distribution, census data",
            "situation": "global data, United Nations data"
        },
        "variables": {
            "variable_names": [
                "Region/Country/Area",
                "Year",
                "Population aged 0 to 14 years old (percentage)",
                "Population aged 60+ years old (percentage)",
                "Population density",
                "Population mid-year estimates (millions)",
                "Population mid-year estimates for females (millions)",
                "Population mid-year estimates for males (millions)",
                "Sex ratio (males per 100 females)",
                "Surface area (thousand km2)"
            ],
            "variable_descriptions": [
                "dimension. spatial, location. nations in the world, represents 235 UN-recognized countries and states. country",
                "dimension. time. year, not collected regularly, every 3-5 years; 2005, 2010, 2017, and 2020 but include others too. year",
                "fact. ratio. percentage of people aged less than 14. population_under_14",
                "fact. ratio. percentage of people aged more than 60. population_over_60",
                "fact. count per area. derived. average number of people living in one square km. population_density",
                "fact. count. number of millions of people in the whole country. mid-year estimate. population",
                "fact. count. number of millions of women in the whole country. mid-year estimate. population_female",
                "fact. count. number of millions of men in the whole country. mid-year estimate. population_male",
                "fact. ratio. derived. percentage of men as compared to women, number of 100s of men per 100 women. gender_ratio",
                "fact. area. total surface area covered by country. area"
            ]
        },
        "size": {
            "rows": 991,
            "description": "991 records. a few year-wise records per country, mostly 4 but upto 9. time resolution is roughly 5 years; year-wise records and about 5 years apart. years are usually 2005, 2010, 2017, and 2020 but include others too. location spans 235 UN nations and countries including disputed ones. location resolution is the nations and countries mentioned in the location variable"
        }
    }
}